lvx/base/DataProcessors/бит_РасшифровкаПроизвольногоОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_РасшифровкаПроизвольногоОтчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Comment>Настройка отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбласти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаРезультат</Name>
					<Comment>Таблица результат</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Comment>Элемент данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыРасшифровок</Name>
					<Comment>Параметры расшифровок</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборВОтчете</Name>
					<Comment>Отбор в отчете</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТаблицаПараметры</Name>
					<Comment>Таблица параметры</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПулПодключений</Name>
					<Comment>Пул подключений</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТаблицаАргументов</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьВсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьПустые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Catalogs/бит_ЭлементыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЭлементыДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СпособыКомпоновкиИсточниковДанных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеМногоязычное</Name>
					<Comment>Наименование (на различных языках)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Кодификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГруппы</Name>
					<Comment>Вид группы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыГруппДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Comment>Настройки построителя</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигНесинхронный</Name>
					<Comment>Сдвиг несинхронный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДат</Name>
					<Comment>Сдвиг дат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДатКон</Name>
					<Comment>Сдвиг дат кон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто1</Name>
					<Comment>Вид субконто1</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто2</Name>
					<Comment>Вид субконто2</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто3</Name>
					<Comment>Вид субконто3</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто4</Name>
					<Comment>Вид субконто4</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Comment>Представление отбора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Отключено</Name>
					<Comment>Отключено</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборВОтчете</Name>
					<Comment>Хранилище отбор в отчете</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетРасшифровка</Name>
					<Comment>Отчет расшифровка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьВОтчет</Name>
					<Comment>Не выводить в отчет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Comment>Вид информационной базы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Comment>Подключение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиРасчетаДляФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаРасчета</Name>
							<Comment>Строка расчета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыПересчетаПоКурсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПересчетаПоКурсам</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыПересчетаПоКурсам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/DataProcessors/бит_РасшифровкаПроизвольногоОтчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мМножественнаяРасшифровка; // Хранит признак, того, что выводится расшифровка по нескольким ячейкам.

Перем ОтборВОтчете; // Хранит настройки отбора отчета.

Перем ТаблицаАргументов; // Хранит таблицу аргументов.

Перем ТаблицаПараметры; // Хранит таблицу параметров.

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выводит расшифровку для данного отчета.
// 
// Параметры:
//  ТД  - ТабличныйДокумент
// 
Процедура ОбновитьРасшифровку(ТД) Экспорт
	
	ТД.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	мМножественнаяРасшифровка = ?(ПараметрыРасшифровок.Количество()>1,Истина,Ложь);
	
	ТаблицаАргументов = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеТаблицаАргументов);
	Если ТипЗнч(ТаблицаАргументов) <> Тип("ТаблицаЗначений") Тогда	
		Возврат;	
	КонецЕсли; 	
	
	ОтборВОтчете = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеОтборВОтчете);
	Если ТипЗнч(ОтборВОтчете) <> Тип("ТаблицаЗначений") Тогда	
		Возврат;	
	КонецЕсли; 
	
	ТаблицаПараметры = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеТаблицаПараметры);
	Если ТипЗнч(ТаблицаПараметры) <> Тип("ТаблицаЗначений") Тогда	
		Возврат;	
	КонецЕсли; 
	
	Для каждого НастройкаРасшифровки Из ПараметрыРасшифровок Цикл
		
		флРучнаяКорректировка = Ложь;
		Если ЗначениеЗаполнено(НастройкаРасшифровки.ИмяОбласти) Тогда			
			ЗначениеЯчейки = ПолучитьЗначениеАргумента(НастройкаРасшифровки.ИмяОбласти,ТаблицаАргументов,флРучнаяКорректировка);			
		Иначе			
			ЗначениеЯчейки = ПолучитьЗначениеЭД(ТаблицаРезультат
												,НастройкаРасшифровки.ЭлементДанных
												,НастройкаРасшифровки.ИмяРесурса);			
		КонецЕсли; 
		
		СтрФормат = ОпределитьФорматЧисел(НастройкаРасшифровки);
		
		ВывестиОбластьЗаголовок(ТД,Макет,НастройкаРасшифровки,флРучнаяКорректировка);
		
		Если НЕ флРучнаяКорректировка Тогда
			
			Если НастройкаРасшифровки.ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Формула Тогда
				
				ВывестиРасшифровкуФормулы(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат);		
				
			ИначеЕсли НастройкаРасшифровки.ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение Тогда
				
				Если НастройкаРасшифровки.ВидЭлементаДанных = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных Тогда
					
					Итог = 0;
					ВывестиРасшифровкуЗначения(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат,Итог);
					
					ЗначениеКВыводу = ?(ЗначениеЯчейки = 0,Итог,ЗначениеЯчейки);
					ТекстОписания = НСтр("ru='Итого по ячейке';en='Cell total'");
					ВывестиОбластьОписание(ТД, Макет, ЗначениеКВыводу, ТекстОписания, СтрФормат);
					
				ИначеЕсли НастройкаРасшифровки.ВидЭлементаДанных = Перечисления.бит_ВидыГруппДанных.Группировка Тогда
					
					ВывестиРасшифровкуГруппыЭлементовДанных(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат);
					
				ИначеЕсли НастройкаРасшифровки.ВидЭлементаДанных = Перечисления.бит_ВидыГруппДанных.Формула Тогда
					
					ВывестиРасшифровкуФормулыЭлементаДанных(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат);
										
				КонецЕсли; // По виду группы элемента данных				
				
				
			КонецЕсли; // По виду ячейки
			
		Иначе	
			
			// Ячейка скорректирована вручную - расшифровку не выводим, выводим только значение.
			ТекстОписания = НСтр("ru='Итого по ячейке';en='Cell total'");
			ВывестиОбластьОписание(ТД, Макет, ЗначениеЯчейки, ТекстОписания, СтрФормат);
			
		КонецЕсли; // Ручная корректировка
		
	КонецЦикла; 
	
	ТД.ТолькоПросмотр = Истина;

КонецПроцедуры // ОбновитьРасшифровку()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция определяет формат для вывода значений. Первый приоритет настройка формата из ячейки,
// далее из шапки, если формат не задан, то Число(15,2).
// 
// Параметры:
//  НастройкаРасшифровки  - Структура.
// 
// Возвращаемое значение:
//   Строка.
// 
Функция ОпределитьФорматЧисел(НастройкаРасшифровки)
	
	// Определим, какую настройку формата применять.
	Если НЕ ПустаяСтрока(НастройкаРасшифровки.ФорматЧисел) Тогда		
		СтрФормат = НастройкаРасшифровки.ФорматЧисел;		
	Иначе			
		Если НЕ ПустаяСтрока(ФорматЧисел) Тогда			
			СтрФормат = ФорматЧисел;			
		Иначе				
			СтрФормат = "ЧЦ=15; ЧДЦ=2";			
		КонецЕсли; 		
	КонецЕсли; 
	
	Возврат СтрФормат;
	
КонецФункции // ОпределитьФорматПоСтрокеПравил()

// Функция получает значение аргумента по имени из таблицы аргументов.
// 
// Параметры:
//  ИмяАргумента  - Строка.
//  ТабАргументов - ТаблицаЗначений.
//  РучнаяКорректировка - Булево - Признак, того, что значение было отредактирована в отчете вручную.
// 
// Возвращаемое значение:
//   Результат    - Число.
// 
Функция ПолучитьЗначениеАргумента(ИмяАргумента, ТабАргументов, РучнаяКорректировка = Ложь)
	
	Результат = 0;
	
	СтрОтбор = Новый Структура("ИмяОбласти",ИмяАргумента);
	
	МассивСтрок = ТабАргументов.НайтиСтроки(СтрОтбор);
	
	Если ТабАргументов.Колонки.Найти("ЗначениеПоказателя") <> Неопределено Тогда		
		ИмяРесурса = "ЗначениеПоказателя";		
	Иначе	
		ИмяРесурса = "Значение";		
	КонецЕсли; 
	
	Для каждого СтрокаАргументы Из МассивСтрок Цикл
	
		Результат = Результат + СтрокаАргументы[ИмяРесурса];
		
		Если СтрокаАргументы.РучнаяКорректировка = Истина Тогда		
			РучнаяКорректировка = СтрокаАргументы.РучнаяКорректировка;		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции // ПолучитьЗначениеАргумента()

// Функция получает значение из ТаблицыРезультатов по элементу данных.
// 
// Параметры:
//  ТабРезультат  - ТаблицаЗначений.
//  ЭлементДанных - СправочникСсылка.бит_ЭлементыДанных.
//  ИмяРесурса    - Строка.
// 
// Возвращаемое значение:
//   Результат    - Число.
// 
Функция ПолучитьЗначениеЭД(ТабРезультат, ЭлементДанных, ИмяРесурса)
	
	Результат = 0;
	
	Если ТабРезультат.Колонки.Найти("ЭлементДанных") <> Неопределено Тогда
		
		СтрокаТаблицыРезультат = ТабРезультат.Найти(ЭлементДанных,"ЭлементДанных");	
		Если СтрокаТаблицыРезультат <> Неопределено Тогда			
			Результат = СтрокаТаблицыРезультат[ИмяРесурса];			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьЗначениеТаблицаРезультат()

// Функция формирует отступ заданного уровня. Используется при выводе по группировкам.
// 
// Параметры:
//  Уровень  - Число
// 
// Возвращаемое значение:
//   СтрОтступ - Строка
// 
Функция СформироватьОтступ(Уровень) 
	
	СтрОтступ = "";
	Для й = 0 По Уровень Цикл	
		СтрОтступ = СтрОтступ + " ";	
	КонецЦикла; 

	Возврат СтрОтступ;
	
КонецФункции // СформироватьОтступ()

// Функция формирует заголовок расшифровываемой ячейки.
// 
// Параметры:
//  ИмяОбласти    -  Строка.
//  НастройкаРасшифровки -  Структура.
//  РучнаяКорректировка - Булево.
// 
// Возвращаемое значение:
//   ЗаголовокЯчейки   - Строка.
// 
Функция СформироватьЗаголовокЯчейки(ИмяОбласти,НастройкаРасшифровки,РучнаяКорректировка)

	ЗаголовокЯчейки = ИмяОбласти;
	
	Если НЕ ПустаяСтрока(НастройкаРасшифровки.ЭлементДанных.Описание) Тогда		
		ТекстНаименования = НастройкаРасшифровки.ЭлементДанных.Описание;		
	Иначе
		ТекстНаименования = НастройкаРасшифровки.ЭлементДанных.Наименование;		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстНаименования) Тогда		
		ЗаголовокЯчейки = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(ЗаголовокЯчейки, ТекстНаименования, " - ");		
	КонецЕсли; 
	
	Если РучнаяКорректировка Тогда		
		СтрокаДополнение = НСтр("ru='Отредактировано вручную.';en='Manually edited.'");
		ЗаголовокЯчейки  = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(ЗаголовокЯчейки, СтрокаДополнение, " - ");		
	КонецЕсли; 

	Возврат ЗаголовокЯчейки;
	
КонецФункции // СформироватьЗаголовокЯчейки()

// Процедура выводит область заголовка ячейки расшифровки.
// 
// Параметры:
//  ТД    - ТабличныйДокумент.
//  Макет - ТабличныйДокумент.
//  НастройкаРасшифровки - Структура.
//  РучнаяКорректировка  - Булево.
// 
Процедура ВывестиОбластьЗаголовок(ТД,Макет,НастройкаРасшифровки,РучнаяКорректировка)
	
	ОблМакета = Макет.ПолучитьОбласть("Заголовок");	
	
	Если НЕ ПустаяСтрока(НастройкаРасшифровки.ИмяОбласти) Тогда		
		Расш = Новый Структура("ТипРасшифровки,ЗначениеРасшифровки", "ВернутьсяВОтчет", НастройкаРасшифровки.ИмяОбласти);
		ОблМакета.Параметры.ЗначениеРасшифровки = Расш;		
	КонецЕсли; 
	
	ОблМакета.Параметры.Заголовок = СформироватьЗаголовокЯчейки(НастройкаРасшифровки.ИмяОбласти
																,НастройкаРасшифровки
																,РучнаяКорректировка);
	ТД.Вывести(ОблМакета);
	
	
КонецПроцедуры // ВывестиОбластьЗаголовок()

// Процедура выводит область описания ячейки расшифровки.
// 
// Параметры:
//  ТД    - ТабличныйДокумент
//  Макет - ТабличныйДокумент
//  ЗначениеЯчейки - Число
//  ОписаниеЯчейки - Строка
//  СтрФормат	   - Строка
// 
Процедура ВывестиОбластьОписание(ТД,Макет,ЗначениеЯчейки,ОписаниеЯчейки,СтрФормат)
	
	ОблМакета = Макет.ПолучитьОбласть("Описание");
	ОблМакета.Параметры.РезультатЗначение = Формат(ЗначениеЯчейки,СтрФормат);
	ОблМакета.Параметры.РезультатОписание = ОписаниеЯчейки;
	ТД.Вывести(ОблМакета);
	
КонецПроцедуры // ВывестиОбластьОписание()

// Процедура выводит расшифровку группы элементов данных.
// 
// Параметры:
//  ТД    - ТабличныйДокумент.
//  Макет - ТабличныйДокумент.
//  НастройкаРасшифровки - Структура.
//  ЗначениеЯчейки       - Число.
//  СтрФормат            - Строка.
// 
Процедура ВывестиРасшифровкуГруппыЭлементовДанных(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат)

	// Получим элементы данных, входящие в данную группу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаЭлементов" , НастройкаРасшифровки.ЭлементДанных);
	Запрос.УстановитьПараметр("СпособКомпоновки", НастройкаОтчета.СпособКомпоновки);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ЭлементыДанных.Ссылка КАК Ссылка,
	|	бит_ЭлементыДанных.ИсточникДанных,
	|	бит_ЭлементыДанных.Коэффициент,
	|	бит_ЭлементыДанных.НастройкиПостроителя,
	|	бит_ЭлементыДанных.ВидГруппы
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	|ГДЕ
	|	бит_ЭлементыДанных.Ссылка В ИЕРАРХИИ(&ГруппаЭлементов)
	|	И бит_ЭлементыДанных.Владелец = &СпособКомпоновки
	|	И бит_ЭлементыДанных.Ссылка <> &ГруппаЭлементов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	Результат = Запрос.Выполнить();
	
	// Сформируем массив элементов данных
	ТзВрем = Результат.Выгрузить();
	МассивЭлементов = ТзВрем.ВыгрузитьКолонку("Ссылка");
	
	Если МассивЭлементов.Количество() = 0 Тогда
		МассивЭлементов = Неопределено;
	КонецЕсли; 
	
	// Получим данных по элементам данных, входящим в данную группу.
	ГраницаНач = ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая);

	Параметры = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);
	бит_МеханизмПолученияДанных.ДобавитьОбязательныеПараметрыПроизвольногоОтчета(ЭтотОбъект,Параметры);
	
	СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
	СтрПар.Параметры                = Параметры;
	СтрПар.МассивЭлементов          = МассивЭлементов;
	СтрПар.ОтборВОтчете             = ОтборВОтчете;
	СтрПар.ПоказыватьИндикатор      = Ложь;
	СтрПар.НастройкаПулаПодключений = НастройкаРасшифровки.НастройкаПулаПодключений;
	
	ТаблицаРезультатВрем = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникам(НастройкаОтчета.СпособКомпоновки
																		,ГраницаНач
																		,ГраницаКон
																		,СтрПар);
	
																		
	бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(НастройкаОтчета.СпособКомпоновки,ТаблицаРезультатВрем);
	МассивРесурсов   = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(НастройкаОтчета.СпособКомпоновки,"Ресурс");
	ТаблицаРезультатВрем = бит_МеханизмПолученияДанных.СвернутьРезультат(ТаблицаРезультатВрем,МассивРесурсов);
	
	// Дополним или заменим данные в основной ТаблицаРезультат.
	Если ТаблицаРезультат = Неопределено ИЛИ ТаблицаРезультат.Колонки.Найти("ЭлементДанных") = Неопределено Тогда
		
		ТаблицаРезультат = ТаблицаРезультатВрем.Скопировать();
		
	Иначе	
		
		Для каждого СтрокаТаблицы Из ТаблицаРезультатВрем Цикл
			
			СтрОтбор = Новый Структура;
			СтрОтбор.Вставить("ЭлементДанных",СтрокаТаблицы.ЭлементДанных);
			
			НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(СтрОтбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Для каждого СтрокаНайденная Из НайденныеСтроки Цикл					
					ЗаполнитьЗначенияСвойств(СтрокаНайденная,СтрокаТаблицы);					
				КонецЦикла;  
				
			Иначе	
				
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ТД.НачатьАвтогруппировкуСтрок();
	ОбойтиИерерхиюЭлементовДанных(ТД,Макет,Результат,НастройкаРасшифровки,0,СтрФормат);			  
	ТД.ЗакончитьАвтогруппировкуСтрок();
	
	ТекстОписания = НСтр("ru='Итого по ячейке';en='Cell total'");
	ВывестиОбластьОписание(ТД, Макет, ЗначениеЯчейки, ТекстОписания, СтрФормат);
	
КонецПроцедуры // ВывестиРасшифровкуГруппыЭлементовДанных()

// Процедура выводит расшифровку по ячейке типа Значение, когда она ссылается на ЭлементДанных типа Формула.
// 
// Параметры:
//  ТД    - ТабличныйДокумент.
//  Макет - ТабличныйДокумент.
//  СтрокаПравил   - Структура.
//  ЗначениеЯчейки - Число.
//  СтрФормат      - Строка.
//
Процедура ВывестиРасшифровкуФормулыЭлементаДанных(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат)
	
	// Получим элементы данных, входящие в данную группу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаЭлементов" , НастройкаРасшифровки.ЭлементДанных);
	Запрос.УстановитьПараметр("СпособКомпоновки", НастройкаОтчета.СпособКомпоновки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.СтрокаРасчета.ИсточникДанных КАК ИсточникДанных,
	|	Таблица.СтрокаРасчета.Коэффициент КАК Коэффициент,
	|	Таблица.СтрокаРасчета.НастройкиПостроителя КАК НастройкиПостроителя,
	|	Таблица.СтрокаРасчета.ВидГруппы КАК ВидГруппы,
	|	Таблица.СтрокаРасчета КАК Ссылка,
	|	Таблица.СтрокаРасчета.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Справочник.бит_ЭлементыДанных.СтрокиРасчетаДляФормулы КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ГруппаЭлементов
	|	И Таблица.Ссылка.Владелец = &СпособКомпоновки
	|	И Таблица.СтрокаРасчета <> &ГруппаЭлементов";
	
	Результат = Запрос.Выполнить();
	
	// Сформируем массив элементов данных
	ТзВрем = Результат.Выгрузить();
	МассивЭлементов = ТзВрем.ВыгрузитьКолонку("Ссылка");
	
	Если МассивЭлементов.Количество()=0 Тогда
		МассивЭлементов = Неопределено;
	КонецЕсли; 
	
	// Получим данных по элементам данных, входящим в данную группу.
	ГраницаНач = ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая);

	Параметры = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);
	бит_МеханизмПолученияДанных.ДобавитьОбязательныеПараметрыПроизвольногоОтчета(ЭтотОбъект,Параметры);
	
	СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
	СтрПар.Параметры                = Параметры;
	СтрПар.МассивЭлементов          = МассивЭлементов;
	СтрПар.ОтборВОтчете             = ОтборВОтчете;
	СтрПар.ПоказыватьИндикатор      = Ложь;
	СтрПар.НастройкаПулаПодключений = НастройкаРасшифровки.НастройкаПулаПодключений;
	
	ТаблицаРезультатВрем = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникам(НастройкаОтчета.СпособКомпоновки
																		,ГраницаНач
																		,ГраницаКон
																		,СтрПар);
	
																		
	бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(НастройкаОтчета.СпособКомпоновки,ТаблицаРезультатВрем);
	МассивРесурсов   = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(НастройкаОтчета.СпособКомпоновки,"Ресурс");
	ТаблицаРезультатВрем = бит_МеханизмПолученияДанных.СвернутьРезультат(ТаблицаРезультатВрем,МассивРесурсов);
	
	// Дополним или заменим данные в основной ТаблицаРезультат.
	Если ТаблицаРезультат = Неопределено ИЛИ ТаблицаРезультат.Колонки.Найти("ЭлементДанных") = Неопределено Тогда
		
		ТаблицаРезультат = ТаблицаРезультатВрем.Скопировать();
		
	Иначе	
		
		Для каждого СтрокаТаблицы Из ТаблицаРезультатВрем Цикл
			
			СтрОтбор = Новый Структура;
			СтрОтбор.Вставить("ЭлементДанных",СтрокаТаблицы.ЭлементДанных);
			
			НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(СтрОтбор);
			
			Если НайденныеСтроки.Количество()>0 Тогда
				
				Для каждого СтрокаНайденная Из НайденныеСтроки Цикл					
					ЗаполнитьЗначенияСвойств(СтрокаНайденная, СтрокаТаблицы);					
				КонецЦикла;  
				
			Иначе	
				
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТзВрем Цикл
		
		ИмяРесурса = НастройкаРасшифровки.ИмяРесурса;
		ОблМакета  = Макет.ПолучитьОбласть("Ячейка");
		Значение   = ПолучитьЗначениеЭД(ТаблицаРезультат,СтрокаТаблицы.Ссылка,ИмяРесурса);
					
		СтруктураНастроек = бит_МеханизмПолученияДанных.КонструкторНастройкиРасшифровкиПроизвольногоОтчета();
		
		СтруктураНастроек.ИмяОбласти               = "";
		СтруктураНастроек.ЭлементДанных            = СтрокаТаблицы.Ссылка;
		СтруктураНастроек.ВидЭлементаДанных        = СтрокаТаблицы.ВидГруппы;
		СтруктураНастроек.ИсточникДанных           = СтрокаТаблицы.ИсточникДанных;
		СтруктураНастроек.ИмяРесурса               = ИмяРесурса;
		СтруктураНастроек.ВидЯчейки                = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение;
		СтруктураНастроек.Формула                  = "";
		СтруктураНастроек.ФорматЧисел              = СтрФормат;
		СтруктураНастроек.НастройкаПодключения     = СтрокаТаблицы.Ссылка.НастройкаПодключения;
		СтруктураНастроек.НастройкаПулаПодключений = НастройкаРасшифровки.НастройкаПулаПодключений;
		
		
		Расш = Новый Структура("ТипРасшифровки,ЗначениеРасшифровки","НоваяЯчейка", СтруктураНастроек);
		
		Если НЕ СкрыватьПустые ИЛИ Значение <> 0 Тогда
			
			ОблМакета.Параметры.ЯчейкаОписание = Строка(СтрокаТаблицы.Ссылка);
			ОблМакета.Параметры.ЯчейкаЗначение = Формат(Значение, СтрФормат);
			ТД.Вывести(ОблМакета);
			
		КонецЕсли;
	
	КонецЦикла; 
	
	ТекстОписания = НСтр("ru='Итого по ячейке';en='Cell total'");
	ВывестиОбластьОписание(ТД, Макет, ЗначениеЯчейки, ТекстОписания, СтрФормат);
	
КонецПроцедуры // ВывестиРасшифровкуФормулыЭлементаДанных()

// Процедура обходит иерархию элементов данных и выводит данные в расшифровку. Рекурсивный вызов.
// 
// Параметры:
//  ТД    - ТабличныйДокумент.
//  Макет - ТабличныйДокумент.
//  ВыборкаВерх - ВыборкаИзРезультатаЗапроса.
//  ИмяРесурса  - Строка.
//  Уровень     - Число.
//  СтрФормат   - Строка.
// 
Процедура ОбойтиИерерхиюЭлементовДанных(ТД, Макет, ВыборкаВерх, НастройкаРасшифровки, Уровень, СтрФормат)

	ИмяРесурса = НастройкаРасшифровки.ИмяРесурса;
	
	Выборка = ВыборкаВерх.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ОблМакета = Макет.ПолучитьОбласть("Ячейка");
	
	Пока Выборка.Следующий() Цикл
		
		ЗначениеЯчейки = ПолучитьЗначениеЭД(ТаблицаРезультат,Выборка.Ссылка,ИмяРесурса);
		
		Если Выборка.ВидГруппы = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных Тогда
			
			СтруктураНастроек = бит_МеханизмПолученияДанных.КонструкторНастройкиРасшифровкиПроизвольногоОтчета();
																												 
      		СтруктураНастроек.ИмяОбласти               = "";
			СтруктураНастроек.ЭлементДанных            = Выборка.Ссылка;
			СтруктураНастроек.ВидЭлементаДанных        = Выборка.ВидГруппы;
			СтруктураНастроек.ИсточникДанных           = Выборка.ИсточникДанных;
			СтруктураНастроек.ИмяРесурса               = ИмяРесурса;
			СтруктураНастроек.ВидЯчейки                = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение;
			СтруктураНастроек.Формула                  = "";
			СтруктураНастроек.ФорматЧисел              = СтрФормат;
			СтруктураНастроек.НастройкаПодключения     = Выборка.Ссылка.НастройкаПодключения;
			СтруктураНастроек.НастройкаПулаПодключений = НастройкаРасшифровки.НастройкаПулаПодключений;
																										 
			
			Расш = Новый Структура("ТипРасшифровки,ЗначениеРасшифровки", "НоваяЯчейка", СтруктураНастроек);
			ОблМакета.Параметры.ЗначениеРасшифровки = Расш;
			
		КонецЕсли; 
		
		Если НЕ СкрыватьПустые ИЛИ ЗначениеЯчейки <> 0 Тогда
		
		    СтрОтступ = СформироватьОтступ(Уровень);		
			
			ОблМакета.Параметры.ЯчейкаОписание = СтрОтступ+Строка(Выборка.Ссылка);
			ОблМакета.Параметры.ЯчейкаЗначение = Формат(ЗначениеЯчейки,СтрФормат);
			ТД.Вывести(ОблМакета,Уровень);
			
			ОбойтиИерерхиюЭлементовДанных(ТД,Макет,Выборка,НастройкаРасшифровки,Уровень+1,СтрФормат);
				
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры // ОбойтиИерерхиюЭлементовДанных()

// Процедура выводит расшифровку по ячейке типа формула.
// 
// Параметры:
//  ТД    - ТабличныйДокумент
//  Макет - ТабличныйДокумент
//  СтрокаПравил   - Структура
//  ЗначениеЯчейки - Число
//  СтрФормат      - Строка
// 
Процедура ВывестиРасшифровкуФормулы(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат)
	
	ОблМакета 		  = Макет.ПолучитьОбласть("Ячейка");
	ОблМакетаОперация = Макет.ПолучитьОбласть("Операция");
	
	СтрФормула = НастройкаРасшифровки.Формула;
	
	// В расшифровке формулы выводим значения всех аргументов, а затем выводим формулу.
	МассивАргументов      = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(СтрФормула, "]");
	ОбработанныеАргументы = Новый Соответствие;
	
	Для й = 0 По МассивАргументов.Количество()-1 Цикл
		
		ТекЭлемент = МассивАргументов[й];
		
		Если ПустаяСтрока(ТекЭлемент) Тогда			
			Продолжить;			
		КонецЕсли; 
		
		ПозицияОткр = Найти(ТекЭлемент, "[");		
		Если ПозицияОткр = 0 Тогда			
			Продолжить;			
		КонецЕсли; 
		
		ИмяАргумента = СокрЛП(Сред(ТекЭлемент, ПозицияОткр + 1));
		Если ОбработанныеАргументы[ИмяАргумента] = Неопределено Тогда
			
			ЗначениеАргумента = ПолучитьЗначениеАргумента(ИмяАргумента,ТаблицаАргументов);
			
			Если НЕ СкрыватьПустые ИЛИ ЗначениеАргумента <> 0 Тогда			

				ТекСтрокаПравил = Справочники.бит_ПоказателиПроизвольныхОтчетов.НайтиПоКоду(ИмяАргумента,,, НастройкаОтчета);
				Если ТекСтрокаПравил <> Неопределено Тогда				
					ТекНаименование = СформироватьЗаголовокЯчейки(ИмяАргумента,НастройкаРасшифровки,Ложь);				
				Иначе					
					ТекНаименование = "";				
				КонецЕсли; 
				
				НастройкаРасш = бит_МеханизмПолученияДанных.СформироватьНастройкуРасшифровкиПроизвольногоОтчета(ТекСтрокаПравил, 
									НастройкаРасшифровки.НастройкаПулаПодключений);
				Расш = Новый Структура("ТипРасшифровки,ЗначениеРасшифровки", "НоваяЯчейка", НастройкаРасш);
				
				ОблМакета.Параметры.ЯчейкаОписание 		 = ТекНаименование;
				ОблМакета.Параметры.ЯчейкаЗначение 		 = Формат(ЗначениеАргумента, СтрФормат);
				ОблМакета.Параметры.ЗначениеРасшифровки  = Расш;
				ТД.Вывести(ОблМакета);
				
			КонецЕсли;
		
			ОбработанныеАргументы.Вставить(ИмяАргумента,Истина);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ВывестиОбластьОписание(ТД,Макет,ЗначениеЯчейки,НастройкаРасшифровки.Формула,СтрФормат);
	
	
КонецПроцедуры // ВывестиРасшифровкуФормулы()

// Процедура выводит расшифровку по ячейке типа Значение, когда она ссылается на ЭлементДанных типа Выборка.
// 
// Параметры:
//  ТД    - ТабличныйДокумент.
//  Макет - ТабличныйДокумент.
//  НастройкаРасшифровки  - Структура.
//  ЗначениеЯчейки        - Число.
//  СтрФормат             - Строка.
// 
Процедура ВывестиРасшифровкуЗначения(ТД,Макет,НастройкаРасшифровки,ЗначениеЯчейки,СтрФормат,Итог)
	
	ЭлементДанных = НастройкаРасшифровки.ЭлементДанных;
	
	Если ТипЗнч(НастройкаРасшифровки.ИсточникДанных) <> Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда		
		Возврат;		
	КонецЕсли; 
	
    ИсточникДанных = НастройкаРасшифровки.ИсточникДанных;
		
	// Восстановим настройки построителя при необходимости.
	Если Измерения.Количество() = 0 ИЛИ мМножественнаяРасшифровка Тогда
		Если ЗначениеЗаполнено(ЭлементДанных) Тогда
			Измерения.Загрузить(ЭлементДанных.Измерения.Выгрузить());
		Иначе	
			Измерения.Загрузить(ИсточникДанных.Измерения.Выгрузить());
		КонецЕсли; 
	КонецЕсли; 
	
	ИмяРесурса = НастройкаРасшифровки.ИмяРесурса;
	
	Если ЗначениеЗаполнено(ИсточникДанных) Тогда
		
		ГраницаНач = ДатаНачала;
		ГраницаКон = Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая);
		
		Если ЗначениеЗаполнено(ЭлементДанных) Тогда
			НастройкиПостроителя = ЭлементДанных.НастройкиПостроителя.Получить();
		Иначе	
			НастройкиПостроителя = НастройкаРасшифровки.ИсточникДанных.НастройкиПостроителя.Получить();
		КонецЕсли; 
		
		МассивИзмерения = Новый Массив;
		Для каждого ИзмерениеРасшифровки Из Измерения Цикл
			
			ВремСтр = Новый Структура("ПутьКДанным", ИзмерениеРасшифровки.ПутьКДанным);
			МассивИзмерения.Добавить(ВремСтр);
		
		КонецЦикла; 
		
		Параметры = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);
		бит_МеханизмПолученияДанных.ДобавитьОбязательныеПараметрыПроизвольногоОтчета(ЭтотОбъект,Параметры);		
		
		// Выполним подключения к внешним базам при необходимости.
		ВыполнитьПодключения(НастройкаРасшифровки);
		
		СтрПар = бит_МеханизмПолученияДанных.НовыепараметрыПолучитьДанныеПоИсточнику();
		СтрПар.Параметры                  = Параметры;
		СтрПар.Настройка                  = НастройкиПостроителя;
		СтрПар.ОтборВОтчете               = ОтборВОтчете;
		СтрПар.ВозвращатьРезультатЗапроса = Истина;
		СтрПар.НастройкаПодключения       = НастройкаРасшифровки.НастройкаПодключения;
		СтрПар.НастройкаПулаПодключений   = НастройкаРасшифровки.НастройкаПулаПодключений;
		СтрПар.ПулПодключений             = ПулПодключений;
		Если МассивИзмерения.Количество() > 0 Тогда		
			СтрПар.Измерения = МассивИзмерения;		
		КонецЕсли; 
		
		РезультатыЗапросов = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);
		
		
		Если ЗначениеЗаполнено(ЭлементДанных) Тогда
			
			// Определим имя ресурса в источнике
			ИмяРесурсаСпособа = ИмяРесурса;
			
			СтрОтбор = Новый Структура;
			СтрОтбор.Вставить("ИсточникДанных", ИсточникДанных);
			СтрОтбор.Вставить("ИмяКолонки"	  , ИмяРесурсаСпособа);
			
			МассивСтрок = ЭлементДанных.Владелец.СоответствиеКолонок.НайтиСтроки(СтрОтбор);
			
			Если МассивСтрок.Количество() > 0 Тогда				
				ИмяКолонкиИсточника = МассивСтрок[0].ИмяКолонкиИсточника;				
			КонецЕсли; 
			
			ИмяРесурсаИсточника = Справочники.бит_ИсточникиДанных.ОпределитьИмяРесурсаИсточника(ИсточникДанных,ИмяКолонкиИсточника);
			
		Иначе	
			
			ИмяРесурсаИсточника = Справочники.бит_ИсточникиДанных.ОпределитьИмяРесурсаИсточника(ИсточникДанных,ИмяРесурса);
			
		КонецЕсли; 																	
		
		// Выведем значения расшифровки
		Если НЕ ПустаяСтрока(ИмяРесурсаИсточника) Тогда
			
			ТД.НачатьАвтогруппировкуСтрок();
			ОблМакета = Макет.ПолучитьОбласть("Ячейка");
			ОблМакетаОписание = Макет.ПолучитьОбласть("Описание");
			
			ном = 1;
			КоличествоРезультатов = РезультатыЗапросов.Количество();
			Для каждого КиЗ Из РезультатыЗапросов Цикл
				
				ИтогПред = Итог;
				
				Если КоличествоРезультатов>1 Тогда
					
					// Выведем имя подключения
					ОблМакетаОписание.Параметры.РезультатОписание = КиЗ.Ключ;
					
					ИмяОбласти = "Подключение_" + ном;				
					
					ОблЯчеек = ОблМакетаОписание.Область("R1C5:R1C7");
					ОблЯчеек.Имя = ИмяОбласти;
					
					ТД.Вывести(ОблМакетаОписание,-1);
					
				КонецЕсли; 
				
				// Обходим иерархию расшифровки
				Если КиЗ.Ключ = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда
					
					ОбойтиИерархиюРасшифровки(ТД,ОблМакета,КиЗ.Значение,ИмяРесурсаИсточника,0,СтрФормат, Итог);	
					
				Иначе	
					
					Соединение = ПулПодключений[КиЗ.Ключ];
					КэшПоиска = Новый Соответствие;
					ВидИбИсточник        = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
					ВидИбПриемник        = КиЗ.Ключ.ВидИнформационнойБазы;
					ПравилаПоискаВнешТек = РегистрыСведений.бит_мпд_НазначениеПравилПоискаДанных.ПолучитьПравилаПоиска(ВидИбПриемник,ВидИбИсточник);
										
					ОбойтиИерархиюРасшифровкиВнешняяБаза(Соединение, КиЗ.Ключ, ТД, ОблМакета,
						КиЗ.Значение, ИмяРесурсаИсточника, 0, СтрФормат, Итог, ПравилаПоискаВнешТек, КэшПоиска);
					
					
				КонецЕсли; 
				
				Если КоличествоРезультатов>1 Тогда
					
					// Выводим итог по подключению
					ОблПодключение = ТД.Область(ИмяОбласти);
					Если ОблПодключение <> Неопределено Тогда						
						ОблПодключение.Текст = Формат(Итог-ИтогПред, "ЧЦ=15; ЧДЦ=2");						
					КонецЕсли; 
					
				КонецЕсли; 
				
				ном = ном+1;
			КонецЦикла; // РезультатыЗапросов
			
			ТД.ЗакончитьАвтогруппировкуСтрок();
			
		КонецЕсли; // НЕ ПустаяСтрока(ИмяРесурсаИсточника) 
		
	КонецЕсли; 
		
КонецПроцедуры // ВывестиРасшифровкуЗначения()

// Процедура выполняет подключения к удаленным информационным базам.
// 
// Параметры:
//  НастройкаРасшифровки - Структура.
// 
Процедура ВыполнитьПодключения(НастройкаРасшифровки)
	
	// Выполним подключения к внешним базам при необходимости.
	Если ЗначениеЗаполнено(НастройкаРасшифровки.НастройкаПулаПодключений) Тогда
		
		// Пул подключений
		Для каждого СтрокаТаблицы Из НастройкаРасшифровки.НастройкаПулаПодключений.НастройкиПодключений Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.НастройкаПодключения) Тогда
				
				Если ПулПодключений[СтрокаТаблицы.НастройкаПодключения] = Неопределено Тогда
					
					Соединение = бит_ПолучениеДанных.ПодключитьКОМ(СтрокаТаблицы.НастройкаПодключения);
					Если Соединение <> Неопределено Тогда						
						ПулПодключений.Вставить(СтрокаТаблицы.НастройкаПодключения, Соединение);						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; // НастройкаРасшифровки.НастройкаПулаПодключений.
		
	Иначе	
		
		// Одно подключение
		Если ЗначениеЗаполнено(НастройкаРасшифровки.НастройкаПодключения) Тогда
			
			Если ПулПодключений[НастройкаРасшифровки.НастройкаПодключения] = Неопределено Тогда
				
				Соединение = бит_ПолучениеДанных.ПодключитьКОМ(НастройкаРасшифровки.НастройкаПодключения);
				
				Если Соединение <> Неопределено Тогда					
					ПулПодключений.Вставить(НастройкаРасшифровки.НастройкаПодключения, Соединение);					
				КонецЕсли; 
				
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЕсли; // ЗначениеЗаполнено(НастройкаРасшифровки.НастройкаПулаПодключений).
	
	
КонецПроцедуры // ВыполнитьПодключения()

// Процедура обходит иерархию измерений, используемых для расшифровки и выводит данные. 
// Рекурсивный вызов.
// 
// Параметры:
//  ТД  - ТабличныйДокумент.
//  Обл - ТабличныйДокумент.
//  ВыборкаВерх - ВыборкаИзРезультатаЗапроса.
//  ИмяРесурса  - Строка.
//  Уровень     - Число.
//  СтрФормат   - Строка.
// 
Процедура ОбойтиИерархиюРасшифровки(ТД,Обл,ВыборкаВерх,ИмяРесурса,Уровень,СтрФормат,Итог)
	
	Если Уровень+1 <= Измерения.Количество() Тогда
	
		 ИзмерениеРасшифровки = Измерения[Уровень];
		 ИмяИзмерения = ИзмерениеРасшифровки.ПутьКДанным;
		 ИмяИзмерения = СтрЗаменить(ИмяИзмерения, ".", "");
		 
	 Иначе
		 
		 Возврат;
		 
	КонецЕсли;
	
	СтрОтступ = СформироватьОтступ(Уровень);
	
	Выборка = ВыборкаВерх.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Обл.Параметры.ЯчейкаОписание = СтрОтступ + Строка(Выборка[ИмяИзмерения]);
		Обл.Параметры.ЗначениеРасшифровки = Выборка[ИмяИзмерения];		
		ЗначениеРесурса = ?(ТипЗнч(Выборка[ИмяРесурса]) = Тип("Число"),Выборка[ИмяРесурса], 0);
		
		Если НЕ СкрыватьПустые ИЛИ ЗначениеРесурса <> 0 Тогда
			Обл.Параметры.ЯчейкаЗначение = Формат(ЗначениеРесурса, СтрФормат);		
			Итог = Итог + ЗначениеРесурса;			
			ТД.Вывести(Обл, Уровень);
			ОбойтиИерархиюРасшифровки(ТД, Обл, Выборка, ИмяРесурса, Уровень+1, СтрФормат,0);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // ОбойтиИерархию()

// Процедура обходит иерархию измерений, используемых для расшифровки и выводит данные. 
// Рекурсивный вызов.
// 
// Параметры:
//  ТД  - ТабличныйДокумент.
//  Обл - ТабличныйДокумент.
//  ВыборкаВерх - ВыборкаИзРезультатаЗапроса.
//  ИмяРесурса  - Строка.
//  Уровень     - Число.
//  СтрФормат   - Строка.
//  Итог        - Число.
//  КэшПоиска   - Соответствие.
// 
Процедура ОбойтиИерархиюРасшифровкиВнешняяБаза(Соединение, НастройкаПодключения, ТД, Обл, 
	ВыборкаВерх, ИмяРесурса, Уровень, СтрФормат, Итог, ПравилаПоиска, КэшПоиска)
	
	Если Уровень+1 <= Измерения.Количество() Тогда	
		 ИзмерениеРасшифровки = Измерения[Уровень];
		 ИмяИзмерения = ИзмерениеРасшифровки.ПутьКДанным;		 
	Иначе		 
		 Возврат;		 
	КонецЕсли;
	
	СтрОтступ = СформироватьОтступ(Уровень);
	СписокВрем = Новый СписокЗначений;
	
	Выборка = ВыборкаВерх.Выбрать(Соединение.ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		КонвЗначениеИзмерения = бит_ПолучениеДанныхВнешниеИсточникиСервер.ПреобразоватьЗначениеВнешняяТекущая(Соединение, 
			НастройкаПодключения, Выборка[ИмяИзмерения], ПравилаПоиска, КэшПоиска, СписокВрем);
		
		Если ТипЗнч(КонвЗначениеИзмерения) = Тип("ЭлементСпискаЗначений") 
			ИЛИ ТипЗнч(КонвЗначениеИзмерения) = Тип("Структура") Тогда
			Обл.Параметры.ЯчейкаОписание = СтрОтступ + Строка(КонвЗначениеИзмерения.Представление);
		Иначе	
			Обл.Параметры.ЯчейкаОписание = СтрОтступ + Строка(КонвЗначениеИзмерения);
		КонецЕсли; 
		
		Обл.Параметры.ЗначениеРасшифровки = КонвЗначениеИзмерения;
		
		КонвЗначение = бит_ПолучениеДанныхВнешниеИсточникиСервер.ПреобразоватьЗначениеВнешняяТекущая(Соединение, 
			НастройкаПодключения, Выборка[ИмяРесурса], ПравилаПоиска, КэшПоиска, СписокВрем);
		
		Если ТипЗнч(КонвЗначение) <> Тип("Число") Тогда		
			КонвЗначение = 0;		
		КонецЕсли; 
		
		Если НЕ СкрыватьПустые ИЛИ КонвЗначение <> 0 Тогда
			Обл.Параметры.ЯчейкаЗначение = Формат(КонвЗначение, СтрФормат);
			Итог                         = Итог + КонвЗначение;
			ТД.Вывести(Обл,Уровень);
			ОбойтиИерархиюРасшифровкиВнешняяБаза(Соединение, НастройкаПодключения, ТД, Обл, 
				Выборка, ИмяРесурса, Уровень+1, СтрФормат, 0, ПравилаПоиска, КэшПоиска);	
		КонецЕсли;		
		
	КонецЦикла; 
	
КонецПроцедуры // ОбойтиИерархиюРасшифровкиВнешняяБаза()

#КонецОбласти

#Область Инициализация

мМножественнаяРасшифровка = Ложь;

Если ПулПодключений = Неопределено Тогда

	ПулПодключений = Новый Соответствие;

КонецЕсли; 

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
